src/Documents/ФинансовыйПлан/ФинансовыйПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФинансовыйПлан</name>
  <registerRecords>AccumulationRegister.ПланируемаяОплатаЗаявок</registerRecords>
  <registerRecords>AccumulationRegister.ПланируемыеДвижения</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планирование</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетОрганизации</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКонтрагента</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>800</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаЗаявки</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияОперации</name>
      <type>
        <types>CatalogRef.КатегорииОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсОплатыФиксированный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаПлатежа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаВыполнена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АвторСтроки</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUIDСтрокиФинансовогоПлана</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDЗаявки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаВзятаВРаботу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УправленческийУчетЗаявок</name>
    <attributes>
      <name>GUIDСтрокиФинансовогоПлана</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретРедактирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Необязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПараметра</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ПланируемыеДвижения/ПланируемыеДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланируемыеДвижения</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланируемаяОплата</name>
    <type>
      <types>DocumentRef.Операция</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/БанковскиеСчета/БанковскиеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчета</name>
  <owners>Catalog.Организации</owners>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>НомерСчета</name>
    <comment>Номер расчетного счета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <comment>Дата открытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <comment>Дата закрытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидыБанковскихСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарныйБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьСписаниеВМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВладельцаОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПоказыватьВВыборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ФинансовыйПлан/ObjectModule.bsl
Перем СписокСохраненныхЗаявок Экспорт;
Перем СписокТекущихЗаявок Экспорт;

Процедура ОбработкаПроведения(Отказ, Режим)

	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Для Каждого СтрокаТЧ Из Планирование Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.GUIDСтрокиФинансовогоПлана) Тогда
			СтрокаТЧ.GUIDСтрокиФинансовогоПлана = СокрЛП(Новый УникальныйИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Если НЕ ПометкаУдаления И РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	мРубли = ПараметрыСеанса.ВалютаРегламентированногоУчета;
	УстановитьПривилегированныйРежим(Истина);
	Движения.ПланируемыеДвижения.Очистить();

	// ***********************
	
	Если НЕ ПометкаУдаления Тогда
		
		// --- Статусы документов
		
		//Если ТипЗнч(СписокСохраненныхЗаявок) = Тип("Массив") И ТипЗнч(СписокТекущихЗаявок) = Тип("Массив") Тогда // Работа с SQL
		//	
		//	МассивЗаявкиДобавились = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СписокТекущихЗаявок, СписокСохраненныхЗаявок);
		//	МассивЗаявкиУдалились = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СписокСохраненныхЗаявок, СписокТекущихЗаявок);
		//	
		//	Запрос = Новый Запрос("ВЫБРАТЬ
		//	|	Заявка.Ссылка КАК Заявка,
		//	|	Заявка.IDЗаявки КАК IDЗаявки
		//	|ИЗ
		//	|	Документ.Заявка КАК Заявка
		//	|ГДЕ
		//	|	Заявка.Ссылка В (&МассивЗаявок)");
		//	
		//	Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявкиДобавились);
		//	
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	Пока Выборка.Следующий() Цикл
		//		ОчередьSQL.ДобавитьВОчередь(РаботаСЗаявкамиСервер.ТекстЗапроса_ВзятьВРаботу(Выборка.IDЗаявки));
		//	КонецЦикла;
		//	
		//	
		//	Запрос = Новый Запрос("ВЫБРАТЬ
		//	|	Заявка.Ссылка КАК Ссылка
		//	|ПОМЕСТИТЬ ВТ_Заявки
		//	|ИЗ
		//	|	Документ.Заявка КАК Заявка
		//	|ГДЕ
		//	|	Заявка.Ссылка В(&СписокЗаявок)
		//	|;
		//	|
		//	|////////////////////////////////////////////////////////////////////////////////
		//	|ВЫБРАТЬ
		//	|	ВТ_Заявки.Ссылка КАК Заявка,
		//	|	СтатусыЗаявок.Заявка КАК ЗаявкаРегистра,
		//	|	СтатусыЗаявок.Статус КАК Статус,
		//	|	ВТ_Заявки.Ссылка.IDЗаявки КАК IDЗаявки
		//	|ИЗ
		//	|	ВТ_Заявки КАК ВТ_Заявки
		//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаявок КАК СтатусыЗаявок
		//	|		ПО ВТ_Заявки.Ссылка = СтатусыЗаявок.Заявка
		//	|			И (СтатусыЗаявок.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.ВРаботе))
		//	|			И (СтатусыЗаявок.Документ ССЫЛКА Документ.ФинансовыйПлан)
		//	|			И (СтатусыЗаявок.Документ <> &Регистратор)
		//	|ГДЕ
		//	|	СтатусыЗаявок.Заявка ЕСТЬ NULL");
		//	
		//	Запрос.УстановитьПараметр("Регистратор", Ссылка);
		//	Запрос.УстановитьПараметр("СписокЗаявок", МассивЗаявкиУдалились);
		//	
		//	РезультатЗапроса = Запрос.Выполнить();
		//	
		//	Выборка = РезультатЗапроса.Выбрать();
		//	
		//	Пока Выборка.Следующий() Цикл
		//		ОчередьSQL.ДобавитьВОчередь(РаботаСЗаявкамиСервер.ТекстЗапроса_ОтменитьВзятиеВРаботу(Выборка.IDЗаявки));
		//	КонецЦикла;
		//	
		//КонецЕсли;
		
		//Если Истина ИЛИ НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("АвтоматическаяЗапись") Тогда
		//	
		//	// --- Планируемые движения
		//	
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = "ВЫБРАТЬ
		//	|	ФинансовыйПланПланирование.Ссылка.Дата КАК Период,
		//	|	ФинансовыйПланПланирование.ПланируемаяОплата КАК ПланируемаяОплата,
		//	|	ФинансовыйПланПланирование.Организация КАК Организация,
		//	|	ФинансовыйПланПланирование.СчетОрганизации КАК СчетОрганизации,
		//	|	ЕСТЬNULL(ФинансовыйПланПланирование.Контрагент.ВнутренняяОрганизация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ОрганизацияПолучатель,
		//	|	ЕСТЬNULL(ФинансовыйПланПланирование.СчетКонтрагента.ПарныйБанковскийСчет, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) КАК СчетОрганизацииПолучатель,
		//	|	ФинансовыйПланПланирование.Валюта КАК Валюта,
		//	|	ФинансовыйПланПланирование.Сумма КАК Сумма,
		//	|	ФинансовыйПланПланирование.ВалютнаяСумма КАК ВалютнаяСумма,
		//	|	ФинансовыйПланПланирование.Организация.ВнутреннийКонтрагент КАК Контрагент,
		//	|	ФинансовыйПланПланирование.СчетОрганизации.ПарныйБанковскийСчет КАК СчетКонтрагента,
		//	|	ФинансовыйПланПланирование.СчетОрганизации.ВалютаДенежныхСредств КАК ВалютаДенежныхСредствСчета,
		//	|	ВЫРАЗИТЬ(ЕСТЬNULL(ФинансовыйПланПланирование.Контрагент.ВнутренняяОрганизация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Справочник.Организации).ВидОрганизации КАК ВидОрганизацииПолучателя,
		//	|	ВЫРАЗИТЬ(ЕСТЬNULL(ФинансовыйПланПланирование.Контрагент.ВнутренняяОрганизация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Справочник.Организации).ЭтоИностраннаяОрганизация КАК ОрганизацияПолучателяЭтоИностраннаяОрганизация,
		//	|	ФинансовыйПланПланирование.СчетКонтрагента.ВалютаДенежныхСредств КАК СчетПолучателяВалютаДенежныхСредствСчета
		//	|ИЗ
		//	|	Документ.ФинансовыйПлан.Планирование КАК ФинансовыйПланПланирование
		//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		//	|		ПО ФинансовыйПланПланирование.Контрагент.ВнутренняяОрганизация = БанковскиеСчета.Владелец
		//	|			И ФинансовыйПланПланирование.СчетКонтрагента.НомерСчета = БанковскиеСчета.НомерСчета
		//	|			И ФинансовыйПланПланирование.СчетКонтрагента.Банк = БанковскиеСчета.Банк
		//	|			И (ФинансовыйПланПланирование.Контрагент.ВнутренняяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		//	|ГДЕ
		//	|	ФинансовыйПланПланирование.Ссылка = &Ссылка
		//	|	И НЕ ФинансовыйПланПланирование.ОтменаПлатежа
		//	|	И ФинансовыйПланПланирование.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		//	|	И ФинансовыйПланПланирование.Сумма <> 0
		//	|	И ФинансовыйПланПланирование.СчетОрганизации.ПарныйБанковскийСчет <> ФинансовыйПланПланирование.СчетКонтрагента
		//	|	И ФинансовыйПланПланирование.СчетОрганизации <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)";
		//	
		//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		//	
		//	РезультатЗапроса = Запрос.Выполнить();
		//	
		//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//	
		//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//		
		//		ЗаписьПриход = Движения.ПланируемыеДвижения.ДобавитьПриход();
		//		ЗаписьПриход.Период = НачалоДня(ВыборкаДетальныеЗаписи.Период);
		//		ЗаполнитьЗначенияСвойств(ЗаписьПриход, ВыборкаДетальныеЗаписи, "Организация, СчетОрганизации, ПланируемаяОплата, Валюта, Сумма, ВалютнаяСумма");
		//		
		//		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетОрганизацииПолучатель)
		//			И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПланируемаяОплата) Тогда
		//			
		//			ЗаписьРасход = Движения.ПланируемыеДвижения.ДобавитьРасход();
		//			ЗаполнитьЗначенияСвойств(ЗаписьРасход,
		//				Новый Структура("Период, Организация, СчетОрганизации, ПланируемаяОплата, Валюта, Сумма, ВалютнаяСумма",
		//				НачалоДня(ВыборкаДетальныеЗаписи.Период),
		//				ВыборкаДетальныеЗаписи.ОрганизацияПолучатель,
		//				ВыборкаДетальныеЗаписи.СчетОрганизацииПолучатель,
		//				ВыборкаДетальныеЗаписи.ПланируемаяОплата,
		//				ВыборкаДетальныеЗаписи.Валюта,
		//				ВыборкаДетальныеЗаписи.Сумма,
		//				ВыборкаДетальныеЗаписи.ВалютнаяСумма
		//			));
		//			
		//		КонецЕсли;
		//		
		//	КонецЦикла;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
	//Движения.ПланируемыеДвижения.Записать();
	//РаботаСЗаявкамиСервер.ОбработатьЗаявкиФинансовогоПланаИзСсылки(Ссылка, ПометкаУдаления);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция КлючСтруктуры(Структура) Экспорт
	
	Ключ = "";
	Для Каждого КлючЗначение Из Структура Цикл
		Ключ = Ключ + КлючЗначение.Ключ + КлючЗначение.Значение;
	КонецЦикла;
	
	Возврат Ключ;
	
КонецФункции




Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	// Проверяем снятие пометки удаления
	Если НЕ ПометкаУдаления И Ссылка.ПометкаУдаления Тогда
		
		МассивНомеровЗаявок = Новый Массив;
		Для Каждого СтрокаТЧ Из Планирование Цикл
			
			Если ЗначениеЗаполнено(СтрокаТЧ.НомерЗаявки) Тогда
				МассивНомеровЗаявок.Добавить(СтрокаТЧ.НомерЗаявки);
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФинансовыйПланПланирование.Ссылка КАК ФинансовыйПлан,
		|	ФинансовыйПланПланирование.НомерЗаявки КАК НомерЗаявки
		|ИЗ
		|	Документ.ФинансовыйПлан.Планирование КАК ФинансовыйПланПланирование
		|ГДЕ
		|	НЕ ФинансовыйПланПланирование.Ссылка.ПометкаУдаления
		|	И ФинансовыйПланПланирование.НомерЗаявки В(&НомераЗаявок)
		|ИТОГИ ПО
		|	ФинансовыйПлан";
		
		Запрос.УстановитьПараметр("НомераЗаявок", МассивНомеровЗаявок);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаФинансовыйПлан = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаФинансовыйПлан.Следующий() Цикл

			ВыборкаДетальныеЗаписи = ВыборкаФинансовыйПлан.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Сообщить("В " + ВыборкаФинансовыйПлан.ФинансовыйПлан + " существует заявка " + ВыборкаДетальныеЗаписи.НомерЗаявки);
				Отказ = Истина;
			КонецЦикла;
			
		КонецЦикла;
		
		Если Отказ = Истина Тогда
			Сообщить("Снятие пометки удаления невозможно!");
		Иначе
			
			СоединениеАДО = ЗапросыЧерезАДО.ПолучитьСоединениеАДО("Fin_Request");
			
			Для Каждого СтрокаТЧ Из Планирование Цикл
				Если ЗначениеЗаполнено(СтрокаТЧ.НомерЗаявки) Тогда
					РаботаСЗаявкамиСервер.SQL_ЗаблокироватьЗаявку(СоединениеАДО, СтрокаТЧ.IDЗаявки);
				КонецЕсли;
			КонецЦикла; 	
			
		КонецЕсли;
		
	КонецЕсли;
		
	
	//Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("АвтоматическаяЗапись") Тогда
	//	ОбработатьПланируемыеОплаты();
	//КонецЕсли;
	
	//Для Каждого СтрокаТЧ Из Планирование Цикл
	//	СтрокаТЧ._Валюта = СтрокаТЧ.СчетОрганизации.ВалютаДенежныхСредств;
	//КонецЦикла;
	
	МассивОрганизаций = Новый Массив;
	МассивСчетовОрганизации = Новый Массив;
	
	Для Каждого СтрокаТЧ Из Планирование Цикл
		МассивОрганизаций.Добавить(СтрокаТЧ.Организация);
		МассивСчетовОрганизации.Добавить(СтрокаТЧ.СчетОрганизации);
	КонецЦикла;
	
	ЗапросПоВалютамСчетов = Новый Запрос("ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК Ссылка,
	|	БанковскиеСчета.Валютный КАК Валютный,
	|	БанковскиеСчета.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Ссылка В (&МассивСчетов)");
	
	ЗапросПоВалютамСчетов.УстановитьПараметр("МассивСчетов", МассивСчетовОрганизации);
	
	ВыборкаПоСчетам = ЗапросПоВалютамСчетов.Выполнить().Выбрать();
	
	Для Каждого СтрокаТЧ Из Планирование Цикл
		ВыборкаПоСчетам.Сбросить();
		Если ВыборкаПоСчетам.НайтиСледующий(Новый Структура("Ссылка", СтрокаТЧ.СчетОрганизации)) Тогда
			//СтрокаТЧ._Валюта = ВыборкаПоСчетам.ВалютаДенежныхСредств;	
			СтрокаТЧ.Валюта = ВыборкаПоСчетам.ВалютаДенежныхСредств;	
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Организации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В (&Организации)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");
	
	Запрос.УстановитьПараметр("Организации", МассивОрганизаций);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Комментарий = "";
	Пока Выборка.Следующий() Цикл
		
		Если Комментарий = "" Тогда
			Комментарий = Выборка.Наименование;
		Иначе
			Комментарий = Комментарий + "; " + Выборка.Наименование;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Ссылка.Пустая() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
КонецПроцедуры
